In [14]:
import pandas as pd
df=pd.read_csv("D:\\Big Data Analytics\\Online\\test.csv")
print(df)

     Name  Marks  Age
0    Ravi   70.0   21
1   Mohan   78.0   23
2   Shyam   80.0   22
3     Icy    NaN   21
4  Saumya   90.0   20

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Name     5 non-null object
Marks    4 non-null float64
Age      5 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 200.0+ bytes

In [15]:
#Addition of Rows data
df1=pd.DataFrame([['Vivek',65,23],['Akriti',45,21]],columns=['Name','Marks','Age'])
df=df.append(df1)
print(df)

     Name  Marks  Age
0    Ravi   70.0   21
1   Mohan   78.0   23
2   Shyam   80.0   22
3     Icy    NaN   21
4  Saumya   90.0   20
0   Vivek   65.0   23
1  Akriti   45.0   21

In [16]:
#Delete Rows
df.drop(0,inplace=True)
print(df)

     Name  Marks  Age
1   Mohan   78.0   23
2   Shyam   80.0   22
3     Icy    NaN   21
4  Saumya   90.0   20
1  Akriti   45.0   21

In [17]:
#Add Column
df['Unit']=pd.Series([20,50,80,55,90])
print(df)

     Name  Marks  Age  Unit
1   Mohan   78.0   23    50
2   Shyam   80.0   22    80
3     Icy    NaN   21    55
4  Saumya   90.0   20    90
1  Akriti   45.0   21    50

In [22]:
#Delete Rows with inplace explanation
df3=df.drop(3,inplace=False)
print(df3)
print(df)

     Name  Marks  Age  Unit
1   Mohan   78.0   23    50
4  Saumya   90.0   20    90
1  Akriti   45.0   21    50
     Name  Marks  Age  Unit
1   Mohan   78.0   23    50
3     Icy    NaN   21    55
4  Saumya   90.0   20    90
1  Akriti   45.0   21    50

In [25]:
df=pd.read_csv("D:\\Big Data Analytics\\Online\\test.csv")
print(df)

     Name  Marks  Age
0    Ravi   70.0   21
1   Mohan   78.0   23
2   Shyam   80.0   22
3     Icy    NaN   21
4  Saumya   90.0   20

In [26]:
#Insert Column in Data Frame
new_data=['Lucknow','Mumbai','Delhi','Lucknow','Lucknow']
df.insert(2,column='City',value=new_data)
print(df)

     Name  Marks     City  Age
0    Ravi   70.0  Lucknow   21
1   Mohan   78.0   Mumbai   23
2   Shyam   80.0    Delhi   22
3     Icy    NaN  Lucknow   21
4  Saumya   90.0  Lucknow   20

In [27]:
#Delete a Column
del df['City']
print(df)

     Name  Marks  Age
0    Ravi   70.0   21
1   Mohan   78.0   23
2   Shyam   80.0   22
3     Icy    NaN   21
4  Saumya   90.0   20

In [37]:
df=pd.read_csv("D:\\Big Data Analytics\\Online\\test.csv")
print(df)
df.info()

     Name    Marks      Age
0    Ravi       70        ?
1   Mohan  Missing       23
2   Shyam       80  Missing
3     Icy  Missing       21
4  Saumya       90       20
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Name     5 non-null object
Marks    5 non-null object
Age      5 non-null object
dtypes: object(3)
memory usage: 200.0+ bytes

In [63]:
df=pd.read_csv("D:\\Big Data Analytics\\Online\\test.csv",na_values=['Missing','?'])
print(df)
df.info()

     Name  Marks   Age     City
0    Ravi   70.0   NaN  Lucknow
1   Mohan    NaN  23.0    Delhi
2   Shyam   80.0   NaN      NaN
3     Icy    NaN  21.0      NaN
4  Saumya   90.0  20.0  Lucknow
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
Name     5 non-null object
Marks    3 non-null float64
Age      3 non-null float64
City     3 non-null object
dtypes: float64(2), object(2)
memory usage: 240.0+ bytes

In [43]:
#Checking missing values

print(df.isnull())

    Name  Marks    Age
0  False  False   True
1  False   True  False
2  False  False   True
3  False   True  False
4  False  False  False

In [44]:
print(df['Marks'].isnull())

0    False
1     True
2    False
3     True
4    False
Name: Marks, dtype: bool

In [46]:
#Counting Null Values for any column
a=df['Marks'].isnull()
count=a.sum()
print(count)

2

In [48]:
print(df['Age'].isnull().sum())

2

In [49]:
print(df['Name'].isnull().sum())

0

In [53]:
#Handling Null Values

#Drop all rows which contain null values

df.dropna(inplace=True)
print(df)

     Name  Marks   Age
4  Saumya   90.0  20.0

In [55]:
print(df)

     Name  Marks   Age
0    Ravi   70.0   NaN
1   Mohan    NaN  23.0
2   Shyam   80.0   NaN
3     Icy    NaN  21.0
4  Saumya   90.0  20.0

In [56]:
df.dropna(axis=1,inplace=True)
print(df)

     Name
0    Ravi
1   Mohan
2   Shyam
3     Icy
4  Saumya

In [64]:
#for Numerical columns: how to handle Null Values
#find the mean of column and replace null value with this mean

m=df['Marks'].mean()

df['Marks'].fillna(m,inplace=True)

print(df)

     Name  Marks   Age     City
0    Ravi   70.0   NaN  Lucknow
1   Mohan   80.0  23.0    Delhi
2   Shyam   80.0   NaN      NaN
3     Icy   80.0  21.0      NaN
4  Saumya   90.0  20.0  Lucknow

In [65]:
m=df['Age'].mean()

df['Age'].fillna(m,inplace=True)

print(df)

     Name  Marks        Age     City
0    Ravi   70.0  21.333333  Lucknow
1   Mohan   80.0  23.000000    Delhi
2   Shyam   80.0  21.333333      NaN
3     Icy   80.0  21.000000      NaN
4  Saumya   90.0  20.000000  Lucknow

In [67]:
#For Categorical values: Count the occurrence/frequency of each value

df['City'].value_counts()
df['City'].fillna("Lucknow",inplace=True)
print(df)

     Name  Marks        Age     City
0    Ravi   70.0  21.333333  Lucknow
1   Mohan   80.0  23.000000    Delhi
2   Shyam   80.0  21.333333  Lucknow
3     Icy   80.0  21.000000  Lucknow
4  Saumya   90.0  20.000000  Lucknow

In [68]:
df.describe()

           Marks        Age
count   5.000000   5.000000
mean   80.000000  21.333333
std     7.071068   1.080123
min    70.000000  20.000000
25%    80.000000  21.000000
50%    80.000000  21.333333
75%    80.000000  21.333333
max    90.000000  23.000000

In [70]:
print(df['Marks'][2])

80.0

In [71]:
#Accessing Rows using loc : similar to Database select operation
#Provide Condition in Square Bracket

a=df.loc[df['Name']=='Ravi']
print(a)

   Name  Marks        Age     City
0  Ravi   70.0  21.333333  Lucknow

In [72]:
a=df.loc[df['City']=='Lucknow']
print(a)

     Name  Marks        Age     City
0    Ravi   70.0  21.333333  Lucknow
2   Shyam   80.0  21.333333  Lucknow
3     Icy   80.0  21.000000  Lucknow
4  Saumya   90.0  20.000000  Lucknow

In [73]:
a=df.loc[df['Age']>22]
print(a)

    Name  Marks   Age   City
1  Mohan   80.0  23.0  Delhi

In [74]:
a=df.loc[df['Age']<22]
print(a)

     Name  Marks        Age     City
0    Ravi   70.0  21.333333  Lucknow
2   Shyam   80.0  21.333333  Lucknow
3     Icy   80.0  21.000000  Lucknow
4  Saumya   90.0  20.000000  Lucknow

In [75]:
#Using iloc.......Multiple Rows can be accessed using index
# df.iloc[Row_Numbers, Column_Numbers]
# start:end or exact index is the way to define Row_Numbers, Column_Numbers
# if you write only : , then it means all.....

print(df.iloc[:,3])

0    Lucknow
1      Delhi
2    Lucknow
3    Lucknow
4    Lucknow
Name: City, dtype: object

In [76]:
print(df.iloc[:2,3])

0    Lucknow
1      Delhi
Name: City, dtype: object

In [77]:
print(df.iloc[2:,3])

2    Lucknow
3    Lucknow
4    Lucknow
Name: City, dtype: object

In [78]:
print(df.iloc[2:,2:])

         Age     City
2  21.333333  Lucknow
3  21.000000  Lucknow
4  20.000000  Lucknow

In [79]:
print(df.iloc[2,2])

21.333333333333332

In [80]:
print(df)

     Name  Marks        Age     City
0    Ravi   70.0  21.333333  Lucknow
1   Mohan   80.0  23.000000    Delhi
2   Shyam   80.0  21.333333  Lucknow
3     Icy   80.0  21.000000  Lucknow
4  Saumya   90.0  20.000000  Lucknow

In [81]:
df['Name_City']=df['Name']+df['City']

In [82]:
print(df)

     Name  Marks        Age     City      Name_City
0    Ravi   70.0  21.333333  Lucknow    RaviLucknow
1   Mohan   80.0  23.000000    Delhi     MohanDelhi
2   Shyam   80.0  21.333333  Lucknow   ShyamLucknow
3     Icy   80.0  21.000000  Lucknow     IcyLucknow
4  Saumya   90.0  20.000000  Lucknow  SaumyaLucknow